CodenameNightwing/WebServices/WS especificos/Sabre/XMLSabreRQ/SessionCloseRQ.xml

<soapenv:Envelope
     xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
     xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext"
     xmlns:mes="http://www.ebxml.org/namespaces/messageHeader"
     xmlns:ns="http://www.opentravel.org/OTA/2002/11">
  <soapenv:Header>
    <sec:Security>
      <sec:BinarySecurityToken valueType="?" EncodingType="?">?</sec:BinarySecurityToken>
    </sec:Security>
    <mes:MessageHeader mes:id="?" mes:version="?">
      <mes:From>
        <mes:PartyId mes:type="?">?</mes:PartyId>
        <mes:Role>?</mes:Role>
      </mes:From>
      <mes:To>
        <mes:PartyId mes:type="?">?</mes:PartyId>
        <mes:Role>?</mes:Role>
      </mes:To>
      <mes:CPAId>AR</mes:CPAId>
      <mes:ConversationId>ARTestSuiteIT</mes:ConversationId>
      <mes:Service mes:type="?">SessionCloseRQ</mes:Service>
      <mes:Action>SessionCloseRQ</mes:Action>
      <mes:MessageData>
        <mes:MessageId>?</mes:MessageId>
        <mes:Timestamp>?</mes:Timestamp>
        <mes:RefToMessageId>?</mes:RefToMessageId>
        <mes:TimeToLive>?</mes:TimeToLive>
        <mes:Timeout>5</mes:Timeout>
      </mes:MessageData>
      <mes:DuplicateElimination>?</mes:DuplicateElimination>
      <mes:Description xml:lang="?">?</mes:Description>
    </mes:MessageHeader>
  </soapenv:Header>
  <soapenv:Body>
    <ns:SessionCloseRQ>
      <ns:POS>
        <ns:Source PseudoCityCode="DSP"/>
      </ns:POS>
    </ns:SessionCloseRQ>
  </soapenv:Body>
</soapenv:Envelope>